/* package up error # */
"error %1$d" = "오류 %1$d";
"error %1$#x" = "오류 %1$#x";
/* errno error 0 */
"Unknown error: 0" = "알 수 없는 오류: 0";

/* errno error 1 */
"Operation not permitted" = "작업이 허용되지 않음";

/* errno error 2 */
"No such file or directory" = "해당 파일 및 디렉토리 없음";

/* errno error 3 */
"No such process" = "해당 프로세스 없음";

/* errno error 4 */
"Interrupted system call" = "시스템 호출 인터럽트";

/* errno error 5 */
"Input/output error" = "입/출력 오류";

/* errno error 6 */
"Device not configured" = "장치가 구성되지 않았음";

/* errno error 7 */
"Argument list too long" = "인자 목록이 너무 깁니다.";

/* errno error 8 */
"Exec format error" = "Exec 형식 오류";

/* errno error 9 */
"Bad file descriptor" = "잘못된 파일 서술자";

/* errno error 10 */
"No child processes" = "자식 프로세스 없음";

/* errno error 11 */
"Resource deadlock avoided" = "리소스 교착 상태 피함";

/* errno error 12 */
"Cannot allocate memory" = "메모리를 할당할 수 없음";

/* errno error 13 */
"Permission denied" = "권한 거부됨";

/* errno error 14 */
"Bad address" = "잘못된 주소";

/* errno error 15 */
"Block device required" = "블럭 장치 필요함";

/* errno error 16 */
"Resource busy" = "리소스 사용 중";

/* errno error 17 */
"File exists" = "파일 존재";

/* errno error 18 */
"Cross-device link" = "교차 장치 링크";

/* errno error 19 */
"Operation not supported by device" = "장치가 해당 작업을 지원하지 않음";

/* errno error 20 */
"Not a directory" = "디렉토리가 아닙니다.";

/* errno error 21 */
"Is a directory" = "디렉토리입니다.";

/* errno error 22 */
"Invalid argument" = "유효하지 않은 인자";

/* errno error 23 */
"Too many open files in system" = "시스템에 너무 많은 파일이 열려 있음";

/* errno error 24 */
"Too many open files" = "너무 많은 파일이 열려 있음";

/* errno error 25 */
"Inappropriate ioctl for device" = "장치에 대한 부적절한 ioctl";

/* errno error 26 */
"Text file busy" = "텍스트 파일이 사용 중입니다.";

/* errno error 27 */
"File too large" = "파일이 너무 큽니다.";

/* errno error 28 */
"No space left on device" = "장비에 남은 공간 없음";

/* errno error 29 */
"Illegal seek" = "잘못된 검색";

/* errno error 30 */
"Read-only file system" = "읽기 전용 파일 시스템";

/* errno error 31 */
"Too many links" = "너무 많은 링크";

/* errno error 32 */
"Broken pipe" = "파이프 연결 해제됨";

/* errno error 33 */
"Numerical argument out of domain" = "도메인 범위 밖의 숫자 인자";

/* errno error 34 */
"Result too large" = "결과가 큽니다.";

/* errno error 35 */
"Resource temporarily unavailable" = "일시적으로 사용 불가능한 리소스";

/* errno error 36 */
"Operation now in progress" = "작업이 현재 진행 중입니다.";

/* errno error 37 */
"Operation already in progress" = "작업이 이미 진행 중입니다.";

/* errno error 38 */
"Socket operation on non-socket" = "비-소켓에 있는 소켓 작업";

/* errno error 39 */
"Destination address required" = "대상 주소 필요함";

/* errno error 40 */
"Message too long" = "메시지가 너무 깁니다.";

/* errno error 41 */
"Protocol wrong type for socket" = "소켓에 대한 잘못된 프로토콜 유형";

/* errno error 42 */
"Protocol not available" = "프로토콜이 사용 불가능함";

/* errno error 43 */
"Protocol not supported" = "프로토콜이 지원되지 않음";

/* errno error 44 */
"Socket type not supported" = "지원되지 않는 소켓 유형";

/* errno error 45 */
"Operation not supported" = "작업이 지원되지 않음";

/* errno error 46 */
"Protocol family not supported" = "프로토콜 계열이 지원되지 않음";

/* errno error 47 */
"Address family not supported by protocol family" = "프로토콜 계열이 주소 계열을 지원하지 않음";

/* errno error 48 */
"Address already in use" = "주소가 이미 사용 중입니다.";

/* errno error 49 */
"Can't assign requested address" = "요청한 주소를 할당할 수 없음";

/* errno error 50 */
"Network is down" = "네트워크가 다운됨";

/* errno error 51 */
"Network is unreachable" = "네트워크가 사용 불가능함";

/* errno error 52 */
"Network dropped connection on reset" = "재설정 중에 네트워크 연결이 끊김";

/* errno error 53 */
"Software caused connection abort" = "소프트웨어에 의한 연결 중단";

/* errno error 54 */
"Connection reset by peer" = "동등(peer)에 의한 연결 재설정";

/* errno error 55 */
"No buffer space available" = "사용 가능한 버퍼 공간 없음";

/* errno error 56 */
"Socket is already connected" = "소켓이 이미 연결되었음";

/* errno error 57 */
"Socket is not connected" = "소켓이 연결되지 않았음";

/* errno error 58 */
"Can't send after socket shutdown" = "소켓이 종료된 다음에 보낼 수 없음";

/* errno error 59 */
"Too many references: can't splice" = "너무 많은 참조: 연결시킬 수 없음";

/* errno error 60 */
"Operation timed out" = "작업 시간 초과";

/* errno error 61 */
"Connection refused" = "연결 거부됨";

/* errno error 62 */
"Too many levels of symbolic links" = "너무 많은 심볼 링크 레벨";

/* errno error 63 */
"File name too long" = "파일 이름이 너무 깁니다.";

/* errno error 64 */
"Host is down" = "호스트가 다운됨";

/* errno error 65 */
"No route to host" = "호스트에 대한 경로가 없음";

/* errno error 66 */
"Directory not empty" = "디렉토리가 비어있지 않음";

/* errno error 67 */
"Too many processes" = "너무 많은 프로세스";

/* errno error 68 */
"Too many users" = "너무 많은 사용자";

/* errno error 69 */
"Disc quota exceeded" = "디스크 할당 초과됨";

/* errno error 70 */
"Stale NFS file handle" = "비정상적인 NFS 파일 조정";

/* errno error 71 */
"Too many levels of remote in path" = "경로 상의 너무 많은 원격 레벨";

/* errno error 72 */
"RPC struct is bad" = "RPC 구조가 잘못됨";

/* errno error 73 */
"RPC version wrong" = "잘못된 RPC 버전";

/* errno error 74 */
"RPC prog. not avail" = "RPC prog. 사용 불가능";

/* errno error 75 */
"Program version wrong" = "잘못된 프로그램 버전";

/* errno error 76 */
"Bad procedure for program" = "프로그램에 대한 잘못된 프로시저";

/* errno error 77 */
"No locks available" = "사용 가능한 잠금 없음";

/* errno error 78 */
"Function not implemented" = "기능이 구현되지 않았습니다.";

/* errno error 79 */
"Inappropriate file type or format" = "부적절한 파일 유형 및 포맷";

/* errno error 80 */
"Authentication error" = "인증 오류";

/* errno error 81 */
"Need authenticator" = "인증자 필요";

/* errno error 82 */
"Device power is off" = "장치 전원이 꺼졌음";

/* errno error 83 */
"Device error" = "장치 오류";

/* errno error 84 */
"Value too large to be stored in data type" = "값이 너무 커서 데이터 유형에 저장되지 않음";

/* errno error 85 */
"Bad executable (or shared library)" = "잘못된 실행(또는 공유된 라이브러리)";

/* errno error 86 */
"Bad CPU type in executable" = "잘못된 CPU 유형이 실행 중입니다.";

/* errno error 87 */
"Shared library version mismatch" = "공유된 라이브러리 버전이 일치하지 않음";

/* errno error 88 */
"Malformed Mach-o file" = "비정상적인 Mach-o 파일";

/* errno error 89 */
"Operation canceled" = "동작이 취소됨";

/* errno error 90 */
"Identifier removed" = "식별자 삭제됨";

/* errno error 91 */
"No message of desired type" = "올바른 유형의 메시지 아님";

/* errno error 92 */
"Illegal byte sequence" = "잘못된 바이트 배열";

/* errno error 93 */
"Attribute not found" = "속성 찾을 수 없음";

/* errno error 94 */
"Bad message" = "잘못된 메시지";

/* errno error 95 */
"EMULTIHOP (Reserved)" = "EMULTIHOP(지정됨)";

/* errno error 96 */
"No message available on STREAM" = "STREAM에 사용 가능한 메시지 없음";

/* errno error 97 */
"ENOLINK (Reserved)" = "ENOLINK(지정됨)";

/* errno error 98 */
"No STREAM resources" = "STREAM 리소스 없음";

/* errno error 99 */
"Not a STREAM" = "STREAM이 아님";

/* errno error 100 */
"Protocol error" = "프로토콜 오류";

/* errno error 101 */
"STREAM ioctl timeout" = "STREAM ioctl 시간 초과";

/* errno error 102 */
"Operation not supported on socket" = "소켓에서 작업이 지원되지 않음";

/* errno error 103 */
"Policy not found" = "정책을 찾을 수 없습니다";
